# 2) გამეორების მიზნით ახსენით რა არის ცვლადი, ცვლადის სახელი და ცვლადის მნიშვნელობა. ვინც ამაზე paint-ში ნახაზსაც გააკეთებს, მივანიჭებ ჯგუფის საუკეთესო მოსწავლის როლს
# ცვლადი – ეს არის კომპიუტერის მეხსიერებაში ადგილი, რომელიც ინახავს გარკვეულ მონაცემს, მაგალითად რიცხვს, ტექსტს ან სხვა სახის ინფორმაციას. ცვლადის საშუალებით პროგრამისტს შეუძლია გაამარტივოს კოდის წერა და ინფორმაციის გადაცემა სხვადასხვა მოქმედებებს შორის.


# 3) შემდეგ მათემატიკურ ოპერაციებზე ჩამოწერეთ 10-10 მაგალითი, გამოიყენეთ ცვლადები: +, -, *, /
# ცვლილები
a = 15
b = 5

# დამატების მაგალითები (+)
print(a + b)        # 15 + 5
print(a + 10)       # 15 + 10
print(b + 20)       # 5 + 20
print(7 + 3)        # 7 + 3
print(a + 3)        # 15 + 3
print(100 + b)      # 100 + 5
print(50 + 25)      # 50 + 25
print(a + a)        # 15 + 15
print(b + b)        # 5 + 5
print(0 + 8)        # 0 + 8

# გამოკლების მაგალითები (-)
print(a - b)        # 15 - 5
print(a - 10)       # 15 - 10
print(20 - b)       # 20 - 5
print(7 - 3)        # 7 - 3
print(b - 3)        # 5 - 3
print(100 - a)      # 100 - 15
print(50 - 25)      # 50 - 25
print(a - a)        # 15 - 15
print(b - b)        # 5 - 5
print(0 - 8)        # 0 - 8

# გამრავლების მაგალითები (*)
print(a * b)        # 15 * 5
print(a * 10)       # 15 * 10
print(b * 20)       # 5 * 20
print(7 * 3)        # 7 * 3
print(a * 3)        # 15 * 3
print(100 * b)      # 100 * 5
print(50 * 25)      # 50 * 25
print(a * a)        # 15 * 15
print(b * b)        # 5 * 5
print(0 * 8)        # 0 * 8

# გაყოფის მაგალითები (/)
print(a / b)        # 15 / 5
print(a / 10)       # 15 / 10
print(20 / b)       # 20 / 5
print(9 / 3)        # 9 / 3
print(b / 3)        # 5 / 3
print(100 / a)      # 100 / 15
print(50 / 25)      # 50 / 25
print(a / a)        # 15 / 15
print(b / b)        # 5 / 5
print(8 / 2)        # 8 / 2


#4) ახსენით რომელია სწორი: კოდის გაშვება ზემოდან ქვემოთ ხდება თუ ქვემოდან ზემოთ
# სწორი არის ზემოდან ქვემოთ


#5) თქვენი სიტყვებით ახსენით, პითონში მონაცემები რამდენ ნაწილად იყოფა, თითოეული როდის გვხვდება და სად ვიყენებთ. ასევე გააკეთეთ paint-ში ნახაზი ამ ინფორმაციის შესახებ (მე როგორც ვხაზავ, შეგიძლიათ მსგავსად დახაზოთ)
